grevaillot/svd_tools/headers/STM32G484xx/hrtim_time.h
#pragma once 

/* --- HRTIM_TIME: High Resolution Timer: TIME ---------------------- */

/** @defgroup hrtim_time_registers High Resolution Timer: TIME Register
@{*/

/** HRTIM_TIME_TIMECR Timerx Control Register **/
#define HRTIM_TIME_TIMECR			MMIO32(HRTIM_TIME_BASE + 0x00)
/** HRTIM_TIME_TIMEISR Timerx Interrupt Status Register **/
#define HRTIM_TIME_TIMEISR			MMIO32(HRTIM_TIME_BASE + 0x04)
/** HRTIM_TIME_TIMEICR Timerx Interrupt Clear Register **/
#define HRTIM_TIME_TIMEICR			MMIO32(HRTIM_TIME_BASE + 0x08)
/** HRTIM_TIME_TIMEDIER TIMxDIER **/
#define HRTIM_TIME_TIMEDIER			MMIO32(HRTIM_TIME_BASE + 0x0c)
/** HRTIM_TIME_CNTER Timerx Counter Register **/
#define HRTIM_TIME_CNTER			MMIO32(HRTIM_TIME_BASE + 0x10)
/** HRTIM_TIME_PERER Timerx Period Register **/
#define HRTIM_TIME_PERER			MMIO32(HRTIM_TIME_BASE + 0x14)
/** HRTIM_TIME_REPER Timerx Repetition Register **/
#define HRTIM_TIME_REPER			MMIO32(HRTIM_TIME_BASE + 0x18)
/** HRTIM_TIME_CMP1ER Timerx Compare 1 Register **/
#define HRTIM_TIME_CMP1ER			MMIO32(HRTIM_TIME_BASE + 0x1c)
/** HRTIM_TIME_CMP1CER Timerx Compare 1 Compound Register **/
#define HRTIM_TIME_CMP1CER			MMIO32(HRTIM_TIME_BASE + 0x20)
/** HRTIM_TIME_CMP2ER Timerx Compare 2 Register **/
#define HRTIM_TIME_CMP2ER			MMIO32(HRTIM_TIME_BASE + 0x24)
/** HRTIM_TIME_CMP3ER Timerx Compare 3 Register **/
#define HRTIM_TIME_CMP3ER			MMIO32(HRTIM_TIME_BASE + 0x28)
/** HRTIM_TIME_CMP4ER Timerx Compare 4 Register **/
#define HRTIM_TIME_CMP4ER			MMIO32(HRTIM_TIME_BASE + 0x2c)
/** HRTIM_TIME_CPT1ER Timerx Capture 1 Register **/
#define HRTIM_TIME_CPT1ER			MMIO32(HRTIM_TIME_BASE + 0x30)
/** HRTIM_TIME_CPT2ER Timerx Capture 2 Register **/
#define HRTIM_TIME_CPT2ER			MMIO32(HRTIM_TIME_BASE + 0x34)
/** HRTIM_TIME_DTER Timerx Deadtime Register **/
#define HRTIM_TIME_DTER			MMIO32(HRTIM_TIME_BASE + 0x38)
/** HRTIM_TIME_SETE1R Timerx Output1 Set Register **/
#define HRTIM_TIME_SETE1R			MMIO32(HRTIM_TIME_BASE + 0x3c)
/** HRTIM_TIME_RSTE1R Timerx Output1 Reset Register **/
#define HRTIM_TIME_RSTE1R			MMIO32(HRTIM_TIME_BASE + 0x40)
/** HRTIM_TIME_SETE2R Timerx Output2 Set Register **/
#define HRTIM_TIME_SETE2R			MMIO32(HRTIM_TIME_BASE + 0x44)
/** HRTIM_TIME_RSTE2R Timerx Output2 Reset Register **/
#define HRTIM_TIME_RSTE2R			MMIO32(HRTIM_TIME_BASE + 0x48)
/** HRTIM_TIME_EEFER1 Timerx External Event Filtering Register 1 **/
#define HRTIM_TIME_EEFER1			MMIO32(HRTIM_TIME_BASE + 0x4c)
/** HRTIM_TIME_EEFER2 Timerx External Event Filtering Register 2 **/
#define HRTIM_TIME_EEFER2			MMIO32(HRTIM_TIME_BASE + 0x50)
/** HRTIM_TIME_RSTER TimerA Reset Register **/
#define HRTIM_TIME_RSTER			MMIO32(HRTIM_TIME_BASE + 0x54)
/** HRTIM_TIME_CHPER Timerx Chopper Register **/
#define HRTIM_TIME_CHPER			MMIO32(HRTIM_TIME_BASE + 0x58)
/** HRTIM_TIME_CPT1ECR Timerx Capture 2 Control Register **/
#define HRTIM_TIME_CPT1ECR			MMIO32(HRTIM_TIME_BASE + 0x5c)
/** HRTIM_TIME_CPT2ECR CPT2xCR **/
#define HRTIM_TIME_CPT2ECR			MMIO32(HRTIM_TIME_BASE + 0x60)
/** HRTIM_TIME_OUTER Timerx Output Register **/
#define HRTIM_TIME_OUTER			MMIO32(HRTIM_TIME_BASE + 0x64)
/** HRTIM_TIME_FLTER Timerx Fault Register **/
#define HRTIM_TIME_FLTER			MMIO32(HRTIM_TIME_BASE + 0x68)
/** HRTIM_TIME_TIMECR2 HRTIM Timerx Control Register 2 **/
#define HRTIM_TIME_TIMECR2			MMIO32(HRTIM_TIME_BASE + 0x6c)
/** HRTIM_TIME_EEEFR3 HRTIM Timerx External Event Filtering Register 3 **/
#define HRTIM_TIME_EEEFR3			MMIO32(HRTIM_TIME_BASE + 0x70)

/**@}*/


/** @defgroup hrtim_time_timecr TIMECR Timerx Control Register
@{*/


#define HRTIM_TIME_TIMECR_UPDGAT_SHIFT		28
#define HRTIM_TIME_TIMECR_UPDGAT_MASK		0x0f
/** @defgroup hrtim_time_timecr_updgat UPDGAT Update Gating
@{*/
/**@}*/

/** HRTIM_TIME_TIMECR_PREEN Preload enable **/
#define HRTIM_TIME_TIMECR_PREEN		(1 << 27)

#define HRTIM_TIME_TIMECR_DACSYNC_SHIFT		25
#define HRTIM_TIME_TIMECR_DACSYNC_MASK		0x03
/** @defgroup hrtim_time_timecr_dacsync DACSYNC AC Synchronization
@{*/
/**@}*/

/** HRTIM_TIME_TIMECR_MSTU Master Timer update **/
#define HRTIM_TIME_TIMECR_MSTU		(1 << 24)
/** HRTIM_TIME_TIMECR_TDU TDU **/
#define HRTIM_TIME_TIMECR_TDU		(1 << 22)
/** HRTIM_TIME_TIMECR_TCU TCU **/
#define HRTIM_TIME_TIMECR_TCU		(1 << 21)
/** HRTIM_TIME_TIMECR_TBU TBU **/
#define HRTIM_TIME_TIMECR_TBU		(1 << 20)
/** HRTIM_TIME_TIMECR_TAU TAU **/
#define HRTIM_TIME_TIMECR_TAU		(1 << 19)
/** HRTIM_TIME_TIMECR_TxRSTU Timerx reset update **/
#define HRTIM_TIME_TIMECR_TxRSTU		(1 << 18)
/** HRTIM_TIME_TIMECR_TxREPU Timer x Repetition update **/
#define HRTIM_TIME_TIMECR_TxREPU		(1 << 17)
/** HRTIM_TIME_TIMECR_TFU TFU **/
#define HRTIM_TIME_TIMECR_TFU		(1 << 16)

#define HRTIM_TIME_TIMECR_DELCMP4_SHIFT		14
#define HRTIM_TIME_TIMECR_DELCMP4_MASK		0x03
/** @defgroup hrtim_time_timecr_delcmp4 DELCMP4 Delayed CMP4 mode
@{*/
/**@}*/


#define HRTIM_TIME_TIMECR_DELCMP2_SHIFT		12
#define HRTIM_TIME_TIMECR_DELCMP2_MASK		0x03
/** @defgroup hrtim_time_timecr_delcmp2 DELCMP2 Delayed CMP2 mode
@{*/
/**@}*/

/** HRTIM_TIME_TIMECR_SYNCSTRTx Synchronization Starts Timer x **/
#define HRTIM_TIME_TIMECR_SYNCSTRTx		(1 << 11)
/** HRTIM_TIME_TIMECR_SYNCRSTx Synchronization Resets Timer x **/
#define HRTIM_TIME_TIMECR_SYNCRSTx		(1 << 10)
/** HRTIM_TIME_TIMECR_RSYNCU Re-Synchronized Update **/
#define HRTIM_TIME_TIMECR_RSYNCU		(1 << 9)

#define HRTIM_TIME_TIMECR_INTLVD_SHIFT		7
#define HRTIM_TIME_TIMECR_INTLVD_MASK		0x03
/** @defgroup hrtim_time_timecr_intlvd INTLVD Interleaved mode
@{*/
/**@}*/

/** HRTIM_TIME_TIMECR_PSHPLL Push-Pull mode enable **/
#define HRTIM_TIME_TIMECR_PSHPLL		(1 << 6)
/** HRTIM_TIME_TIMECR_HALF Half mode enable **/
#define HRTIM_TIME_TIMECR_HALF		(1 << 5)
/** HRTIM_TIME_TIMECR_RETRIG Re-triggerable mode **/
#define HRTIM_TIME_TIMECR_RETRIG		(1 << 4)
/** HRTIM_TIME_TIMECR_CONT Continuous mode **/
#define HRTIM_TIME_TIMECR_CONT		(1 << 3)

#define HRTIM_TIME_TIMECR_CK_PSCx_SHIFT		0
#define HRTIM_TIME_TIMECR_CK_PSCx_MASK		0x07
/** @defgroup hrtim_time_timecr_ck_pscx CKPSCx HRTIM Timer x Clock prescaler
@{*/
/**@}*/


/**@}*/

/** @defgroup hrtim_time_timeisr TIMEISR Timerx Interrupt Status Register
@{*/

/** HRTIM_TIME_TIMEISR_O2CPY Output 2 Copy **/
#define HRTIM_TIME_TIMEISR_O2CPY		(1 << 21)
/** HRTIM_TIME_TIMEISR_O1CPY Output 1 Copy **/
#define HRTIM_TIME_TIMEISR_O1CPY		(1 << 20)
/** HRTIM_TIME_TIMEISR_O2STAT Output 2 State **/
#define HRTIM_TIME_TIMEISR_O2STAT		(1 << 19)
/** HRTIM_TIME_TIMEISR_O1STAT Output 1 State **/
#define HRTIM_TIME_TIMEISR_O1STAT		(1 << 18)
/** HRTIM_TIME_TIMEISR_IPPSTAT Idle Push Pull Status **/
#define HRTIM_TIME_TIMEISR_IPPSTAT		(1 << 17)
/** HRTIM_TIME_TIMEISR_CPPSTAT Current Push Pull Status **/
#define HRTIM_TIME_TIMEISR_CPPSTAT		(1 << 16)
/** HRTIM_TIME_TIMEISR_DLYPRT Delayed Protection Flag **/
#define HRTIM_TIME_TIMEISR_DLYPRT		(1 << 14)
/** HRTIM_TIME_TIMEISR_RST Reset Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_RST		(1 << 13)
/** HRTIM_TIME_TIMEISR_RSTx2 Output 2 Reset Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_RSTx2		(1 << 12)
/** HRTIM_TIME_TIMEISR_SETx2 Output 2 Set Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_SETx2		(1 << 11)
/** HRTIM_TIME_TIMEISR_RSTx1 Output 1 Reset Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_RSTx1		(1 << 10)
/** HRTIM_TIME_TIMEISR_SETx1 Output 1 Set Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_SETx1		(1 << 9)
/** HRTIM_TIME_TIMEISR_CPT2 Capture2 Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_CPT2		(1 << 8)
/** HRTIM_TIME_TIMEISR_CPT1 Capture1 Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_CPT1		(1 << 7)
/** HRTIM_TIME_TIMEISR_UPD Update Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_UPD		(1 << 6)
/** HRTIM_TIME_TIMEISR_REP Repetition Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_REP		(1 << 4)
/** HRTIM_TIME_TIMEISR_CMP4 Compare 4 Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_CMP4		(1 << 3)
/** HRTIM_TIME_TIMEISR_CMP3 Compare 3 Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_CMP3		(1 << 2)
/** HRTIM_TIME_TIMEISR_CMP2 Compare 2 Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_CMP2		(1 << 1)
/** HRTIM_TIME_TIMEISR_CMP1 Compare 1 Interrupt Flag **/
#define HRTIM_TIME_TIMEISR_CMP1		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_timeicr TIMEICR Timerx Interrupt Clear Register
@{*/

/** HRTIM_TIME_TIMEICR_DLYPRTC Delayed Protection Flag Clear **/
#define HRTIM_TIME_TIMEICR_DLYPRTC		(1 << 14)
/** HRTIM_TIME_TIMEICR_RSTC Reset Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_RSTC		(1 << 13)
/** HRTIM_TIME_TIMEICR_RSTx2C Output 2 Reset flag Clear **/
#define HRTIM_TIME_TIMEICR_RSTx2C		(1 << 12)
/** HRTIM_TIME_TIMEICR_SET2xC Output 2 Set flag Clear **/
#define HRTIM_TIME_TIMEICR_SET2xC		(1 << 11)
/** HRTIM_TIME_TIMEICR_RSTx1C Output 1 Reset flag Clear **/
#define HRTIM_TIME_TIMEICR_RSTx1C		(1 << 10)
/** HRTIM_TIME_TIMEICR_SET1xC Output 1 Set flag Clear **/
#define HRTIM_TIME_TIMEICR_SET1xC		(1 << 9)
/** HRTIM_TIME_TIMEICR_CPT2C Capture2 Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_CPT2C		(1 << 8)
/** HRTIM_TIME_TIMEICR_CPT1C Capture1 Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_CPT1C		(1 << 7)
/** HRTIM_TIME_TIMEICR_UPDC Update Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_UPDC		(1 << 6)
/** HRTIM_TIME_TIMEICR_REPC Repetition Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_REPC		(1 << 4)
/** HRTIM_TIME_TIMEICR_CMP4C Compare 4 Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_CMP4C		(1 << 3)
/** HRTIM_TIME_TIMEICR_CMP3C Compare 3 Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_CMP3C		(1 << 2)
/** HRTIM_TIME_TIMEICR_CMP2C Compare 2 Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_CMP2C		(1 << 1)
/** HRTIM_TIME_TIMEICR_CMP1C Compare 1 Interrupt flag Clear **/
#define HRTIM_TIME_TIMEICR_CMP1C		(1 << 0)

/**@}*/

