grevaillot/svd_tools/headers/STM32G484xx/hrtim_time.h
/** HRTIM_TIME_RSTE2R_UPDATE UPDATE **/
#define HRTIM_TIME_RSTE2R_UPDATE		(1 << 31)
/** HRTIM_TIME_RSTE2R_EXTEVNT10 EXTEVNT10 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT10		(1 << 30)
/** HRTIM_TIME_RSTE2R_EXTEVNT9 EXTEVNT9 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT9		(1 << 29)
/** HRTIM_TIME_RSTE2R_EXTEVNT8 EXTEVNT8 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT8		(1 << 28)
/** HRTIM_TIME_RSTE2R_EXTEVNT7 EXTEVNT7 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT7		(1 << 27)
/** HRTIM_TIME_RSTE2R_EXTEVNT6 EXTEVNT6 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT6		(1 << 26)
/** HRTIM_TIME_RSTE2R_EXTEVNT5 EXTEVNT5 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT5		(1 << 25)
/** HRTIM_TIME_RSTE2R_EXTEVNT4 EXTEVNT4 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT4		(1 << 24)
/** HRTIM_TIME_RSTE2R_EXTEVNT3 EXTEVNT3 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT3		(1 << 23)
/** HRTIM_TIME_RSTE2R_EXTEVNT2 EXTEVNT2 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT2		(1 << 22)
/** HRTIM_TIME_RSTE2R_EXTEVNT1 EXTEVNT1 **/
#define HRTIM_TIME_RSTE2R_EXTEVNT1		(1 << 21)
/** HRTIM_TIME_RSTE2R_TIMEVNT9 TIMEVNT9 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT9		(1 << 20)
/** HRTIM_TIME_RSTE2R_TIMEVNT8 TIMEVNT8 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT8		(1 << 19)
/** HRTIM_TIME_RSTE2R_TIMEVNT7 TIMEVNT7 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT7		(1 << 18)
/** HRTIM_TIME_RSTE2R_TIMEVNT6 TIMEVNT6 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT6		(1 << 17)
/** HRTIM_TIME_RSTE2R_TIMEVNT5 TIMEVNT5 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT5		(1 << 16)
/** HRTIM_TIME_RSTE2R_TIMEVNT4 TIMEVNT4 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT4		(1 << 15)
/** HRTIM_TIME_RSTE2R_TIMEVNT3 TIMEVNT3 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT3		(1 << 14)
/** HRTIM_TIME_RSTE2R_TIMEVNT2 TIMEVNT2 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT2		(1 << 13)
/** HRTIM_TIME_RSTE2R_TIMEVNT1 TIMEVNT1 **/
#define HRTIM_TIME_RSTE2R_TIMEVNT1		(1 << 12)
/** HRTIM_TIME_RSTE2R_MSTCMP4 MSTCMP4 **/
#define HRTIM_TIME_RSTE2R_MSTCMP4		(1 << 11)
/** HRTIM_TIME_RSTE2R_MSTCMP3 MSTCMP3 **/
#define HRTIM_TIME_RSTE2R_MSTCMP3		(1 << 10)
/** HRTIM_TIME_RSTE2R_MSTCMP2 MSTCMP2 **/
#define HRTIM_TIME_RSTE2R_MSTCMP2		(1 << 9)
/** HRTIM_TIME_RSTE2R_MSTCMP1 MSTCMP1 **/
#define HRTIM_TIME_RSTE2R_MSTCMP1		(1 << 8)
/** HRTIM_TIME_RSTE2R_MSTPER MSTPER **/
#define HRTIM_TIME_RSTE2R_MSTPER		(1 << 7)
/** HRTIM_TIME_RSTE2R_CMP4 CMP4 **/
#define HRTIM_TIME_RSTE2R_CMP4		(1 << 6)
/** HRTIM_TIME_RSTE2R_CMP3 CMP3 **/
#define HRTIM_TIME_RSTE2R_CMP3		(1 << 5)
/** HRTIM_TIME_RSTE2R_CMP2 CMP2 **/
#define HRTIM_TIME_RSTE2R_CMP2		(1 << 4)
/** HRTIM_TIME_RSTE2R_CMP1 CMP1 **/
#define HRTIM_TIME_RSTE2R_CMP1		(1 << 3)
/** HRTIM_TIME_RSTE2R_PER PER **/
#define HRTIM_TIME_RSTE2R_PER		(1 << 2)
/** HRTIM_TIME_RSTE2R_RESYNC RESYNC **/
#define HRTIM_TIME_RSTE2R_RESYNC		(1 << 1)
/** HRTIM_TIME_RSTE2R_SRT SRT **/
#define HRTIM_TIME_RSTE2R_SRT		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_eefer1 EEFER1 Timerx External Event Filtering Register 1
@{*/


#define HRTIM_TIME_EEFER1_EE5FLTR_SHIFT		25
#define HRTIM_TIME_EEFER1_EE5FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer1_ee5fltr EE5FLTR External Event 5 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER1_EE5LTCH External Event 5 latch **/
#define HRTIM_TIME_EEFER1_EE5LTCH		(1 << 24)

#define HRTIM_TIME_EEFER1_EE4FLTR_SHIFT		19
#define HRTIM_TIME_EEFER1_EE4FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer1_ee4fltr EE4FLTR External Event 4 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER1_EE4LTCH External Event 4 latch **/
#define HRTIM_TIME_EEFER1_EE4LTCH		(1 << 18)

#define HRTIM_TIME_EEFER1_EE3FLTR_SHIFT		13
#define HRTIM_TIME_EEFER1_EE3FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer1_ee3fltr EE3FLTR External Event 3 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER1_EE3LTCH External Event 3 latch **/
#define HRTIM_TIME_EEFER1_EE3LTCH		(1 << 12)

#define HRTIM_TIME_EEFER1_EE2FLTR_SHIFT		7
#define HRTIM_TIME_EEFER1_EE2FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer1_ee2fltr EE2FLTR External Event 2 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER1_EE2LTCH External Event 2 latch **/
#define HRTIM_TIME_EEFER1_EE2LTCH		(1 << 6)

#define HRTIM_TIME_EEFER1_EE1FLTR_SHIFT		1
#define HRTIM_TIME_EEFER1_EE1FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer1_ee1fltr EE1FLTR External Event 1 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER1_EE1LTCH External Event 1 latch **/
#define HRTIM_TIME_EEFER1_EE1LTCH		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_eefer2 EEFER2 Timerx External Event Filtering Register 2
@{*/


#define HRTIM_TIME_EEFER2_EE10FLTR_SHIFT		25
#define HRTIM_TIME_EEFER2_EE10FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer2_ee10fltr EE10FLTR External Event 10 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER2_EE10LTCH External Event 10 latch **/
#define HRTIM_TIME_EEFER2_EE10LTCH		(1 << 24)

#define HRTIM_TIME_EEFER2_EE9FLTR_SHIFT		19
#define HRTIM_TIME_EEFER2_EE9FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer2_ee9fltr EE9FLTR External Event 9 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER2_EE9LTCH External Event 9 latch **/
#define HRTIM_TIME_EEFER2_EE9LTCH		(1 << 18)

#define HRTIM_TIME_EEFER2_EE8FLTR_SHIFT		13
#define HRTIM_TIME_EEFER2_EE8FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer2_ee8fltr EE8FLTR External Event 8 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER2_EE8LTCH External Event 8 latch **/
#define HRTIM_TIME_EEFER2_EE8LTCH		(1 << 12)

#define HRTIM_TIME_EEFER2_EE7FLTR_SHIFT		7
#define HRTIM_TIME_EEFER2_EE7FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer2_ee7fltr EE7FLTR External Event 7 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER2_EE7LTCH External Event 7 latch **/
#define HRTIM_TIME_EEFER2_EE7LTCH		(1 << 6)

#define HRTIM_TIME_EEFER2_EE6FLTR_SHIFT		1
#define HRTIM_TIME_EEFER2_EE6FLTR_MASK		0x0f
/** @defgroup hrtim_time_eefer2_ee6fltr EE6FLTR External Event 6 filter
@{*/
/**@}*/

/** HRTIM_TIME_EEFER2_EE6LTCH External Event 6 latch **/
#define HRTIM_TIME_EEFER2_EE6LTCH		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_rster RSTER TimerA Reset Register
@{*/

/** HRTIM_TIME_RSTER_TIMFCPM2 Timer F Compare 2 **/
#define HRTIM_TIME_RSTER_TIMFCPM2		(1 << 31)
/** HRTIM_TIME_RSTER_TIMDCMP4 Timer D Compare 4 **/
#define HRTIM_TIME_RSTER_TIMDCMP4		(1 << 30)
/** HRTIM_TIME_RSTER_TIMDCMP2 Timer D Compare 2 **/
#define HRTIM_TIME_RSTER_TIMDCMP2		(1 << 29)
/** HRTIM_TIME_RSTER_TIMDCMP1 Timer D Compare 1 **/
#define HRTIM_TIME_RSTER_TIMDCMP1		(1 << 28)
/** HRTIM_TIME_RSTER_TIMCCMP4 Timer C Compare 4 **/
#define HRTIM_TIME_RSTER_TIMCCMP4		(1 << 27)
/** HRTIM_TIME_RSTER_TIMCCMP2 Timer C Compare 2 **/
#define HRTIM_TIME_RSTER_TIMCCMP2		(1 << 26)
/** HRTIM_TIME_RSTER_TIMCCMP1 Timer C Compare 1 **/
#define HRTIM_TIME_RSTER_TIMCCMP1		(1 << 25)
/** HRTIM_TIME_RSTER_TIMBCMP4 Timer B Compare 4 **/
#define HRTIM_TIME_RSTER_TIMBCMP4		(1 << 24)
/** HRTIM_TIME_RSTER_TIMBCMP2 Timer B Compare 2 **/
#define HRTIM_TIME_RSTER_TIMBCMP2		(1 << 23)
/** HRTIM_TIME_RSTER_TIMBCMP1 Timer B Compare 1 **/
#define HRTIM_TIME_RSTER_TIMBCMP1		(1 << 22)
/** HRTIM_TIME_RSTER_TIMACMP4 Timer A Compare 4 **/
#define HRTIM_TIME_RSTER_TIMACMP4		(1 << 21)
/** HRTIM_TIME_RSTER_TIMACMP2 Timer A Compare 2 **/
#define HRTIM_TIME_RSTER_TIMACMP2		(1 << 20)
/** HRTIM_TIME_RSTER_TIMACMP1 Timer A Compare 1 **/
#define HRTIM_TIME_RSTER_TIMACMP1		(1 << 19)
/** HRTIM_TIME_RSTER_EXTEVNT10 External Event 10 **/
#define HRTIM_TIME_RSTER_EXTEVNT10		(1 << 18)
/** HRTIM_TIME_RSTER_EXTEVNT9 External Event 9 **/
#define HRTIM_TIME_RSTER_EXTEVNT9		(1 << 17)
/** HRTIM_TIME_RSTER_EXTEVNT8 External Event 8 **/
#define HRTIM_TIME_RSTER_EXTEVNT8		(1 << 16)
/** HRTIM_TIME_RSTER_EXTEVNT7 External Event 7 **/
#define HRTIM_TIME_RSTER_EXTEVNT7		(1 << 15)
/** HRTIM_TIME_RSTER_EXTEVNT6 External Event 6 **/
#define HRTIM_TIME_RSTER_EXTEVNT6		(1 << 14)
/** HRTIM_TIME_RSTER_EXTEVNT5 External Event 5 **/
#define HRTIM_TIME_RSTER_EXTEVNT5		(1 << 13)
/** HRTIM_TIME_RSTER_EXTEVNT4 External Event 4 **/
#define HRTIM_TIME_RSTER_EXTEVNT4		(1 << 12)
/** HRTIM_TIME_RSTER_EXTEVNT3 External Event 3 **/
#define HRTIM_TIME_RSTER_EXTEVNT3		(1 << 11)
/** HRTIM_TIME_RSTER_EXTEVNT2 External Event 2 **/
#define HRTIM_TIME_RSTER_EXTEVNT2		(1 << 10)
/** HRTIM_TIME_RSTER_EXTEVNT1 External Event 1 **/
#define HRTIM_TIME_RSTER_EXTEVNT1		(1 << 9)
/** HRTIM_TIME_RSTER_MSTCMP4 Master compare 4 **/
#define HRTIM_TIME_RSTER_MSTCMP4		(1 << 8)
/** HRTIM_TIME_RSTER_MSTCMP3 Master compare 3 **/
#define HRTIM_TIME_RSTER_MSTCMP3		(1 << 7)
/** HRTIM_TIME_RSTER_MSTCMP2 Master compare 2 **/
#define HRTIM_TIME_RSTER_MSTCMP2		(1 << 6)
/** HRTIM_TIME_RSTER_MSTCMP1 Master compare 1 **/
#define HRTIM_TIME_RSTER_MSTCMP1		(1 << 5)
/** HRTIM_TIME_RSTER_MSTPER Master timer Period **/
#define HRTIM_TIME_RSTER_MSTPER		(1 << 4)
/** HRTIM_TIME_RSTER_CMP4 Timer A compare 4 reset **/
#define HRTIM_TIME_RSTER_CMP4		(1 << 3)
/** HRTIM_TIME_RSTER_CMP2 Timer A compare 2 reset **/
#define HRTIM_TIME_RSTER_CMP2		(1 << 2)
/** HRTIM_TIME_RSTER_UPDT Timer A Update reset **/
#define HRTIM_TIME_RSTER_UPDT		(1 << 1)
/** HRTIM_TIME_RSTER_TIMFCMP1 Timer A Update reset **/
#define HRTIM_TIME_RSTER_TIMFCMP1		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_chper CHPER Timerx Chopper Register
@{*/


