grevaillot/svd_tools/headers/STM32G484xx/hrtim_time.h
#define HRTIM_TIME_OUTER_FAULT2_SHIFT		20
#define HRTIM_TIME_OUTER_FAULT2_MASK		0x03
/** @defgroup hrtim_time_outer_fault2 FAULT2 Output 2 Fault state
@{*/
/**@}*/

/** HRTIM_TIME_OUTER_IDLES2 Output 2 Idle State **/
#define HRTIM_TIME_OUTER_IDLES2		(1 << 19)
/** HRTIM_TIME_OUTER_IDLEM2 Output 2 Idle mode **/
#define HRTIM_TIME_OUTER_IDLEM2		(1 << 18)
/** HRTIM_TIME_OUTER_POL2 Output 2 polarity **/
#define HRTIM_TIME_OUTER_POL2		(1 << 17)
/** HRTIM_TIME_OUTER_BIAR Balanced Idle Automatic Resume **/
#define HRTIM_TIME_OUTER_BIAR		(1 << 14)

#define HRTIM_TIME_OUTER_DLYPRT_SHIFT		10
#define HRTIM_TIME_OUTER_DLYPRT_MASK		0x07
/** @defgroup hrtim_time_outer_dlyprt DLYPRT Delayed Protection
@{*/
/**@}*/

/** HRTIM_TIME_OUTER_DLYPRTEN Delayed Protection Enable **/
#define HRTIM_TIME_OUTER_DLYPRTEN		(1 << 9)
/** HRTIM_TIME_OUTER_DTEN Deadtime enable **/
#define HRTIM_TIME_OUTER_DTEN		(1 << 8)
/** HRTIM_TIME_OUTER_DIDL1 Output 1 Deadtime upon burst mode Idle entry **/
#define HRTIM_TIME_OUTER_DIDL1		(1 << 7)
/** HRTIM_TIME_OUTER_CHP1 Output 1 Chopper enable **/
#define HRTIM_TIME_OUTER_CHP1		(1 << 6)

#define HRTIM_TIME_OUTER_FAULT1_SHIFT		4
#define HRTIM_TIME_OUTER_FAULT1_MASK		0x03
/** @defgroup hrtim_time_outer_fault1 FAULT1 Output 1 Fault state
@{*/
/**@}*/

/** HRTIM_TIME_OUTER_IDLES1 Output 1 Idle State **/
#define HRTIM_TIME_OUTER_IDLES1		(1 << 3)
/** HRTIM_TIME_OUTER_IDLEM1 Output 1 Idle mode **/
#define HRTIM_TIME_OUTER_IDLEM1		(1 << 2)
/** HRTIM_TIME_OUTER_POL1 Output 1 polarity **/
#define HRTIM_TIME_OUTER_POL1		(1 << 1)

/**@}*/

/** @defgroup hrtim_time_flter FLTER Timerx Fault Register
@{*/

/** HRTIM_TIME_FLTER_FLTLCK Fault sources Lock **/
#define HRTIM_TIME_FLTER_FLTLCK		(1 << 31)
/** HRTIM_TIME_FLTER_FLT6EN Fault 6 enable **/
#define HRTIM_TIME_FLTER_FLT6EN		(1 << 5)
/** HRTIM_TIME_FLTER_FLT5EN Fault 5 enable **/
#define HRTIM_TIME_FLTER_FLT5EN		(1 << 4)
/** HRTIM_TIME_FLTER_FLT4EN Fault 4 enable **/
#define HRTIM_TIME_FLTER_FLT4EN		(1 << 3)
/** HRTIM_TIME_FLTER_FLT3EN Fault 3 enable **/
#define HRTIM_TIME_FLTER_FLT3EN		(1 << 2)
/** HRTIM_TIME_FLTER_FLT2EN Fault 2 enable **/
#define HRTIM_TIME_FLTER_FLT2EN		(1 << 1)
/** HRTIM_TIME_FLTER_FLT1EN Fault 1 enable **/
#define HRTIM_TIME_FLTER_FLT1EN		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_timecr2 TIMECR2 HRTIM Timerx Control Register 2
@{*/

/** HRTIM_TIME_TIMECR2_TRGHLF Triggered-half mode **/
#define HRTIM_TIME_TIMECR2_TRGHLF		(1 << 20)
/** HRTIM_TIME_TIMECR2_GTCMP3 Greater than Compare 3 PWM mode **/
#define HRTIM_TIME_TIMECR2_GTCMP3		(1 << 17)
/** HRTIM_TIME_TIMECR2_GTCMP1 Greater than Compare 1 PWM mode **/
#define HRTIM_TIME_TIMECR2_GTCMP1		(1 << 16)

#define HRTIM_TIME_TIMECR2_FEROM_SHIFT		14
#define HRTIM_TIME_TIMECR2_FEROM_MASK		0x03
/** @defgroup hrtim_time_timecr2_ferom FEROM Fault and Event Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIME_TIMECR2_BMROM_SHIFT		12
#define HRTIM_TIME_TIMECR2_BMROM_MASK		0x03
/** @defgroup hrtim_time_timecr2_bmrom BMROM Burst Mode Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIME_TIMECR2_ADROM_SHIFT		10
#define HRTIM_TIME_TIMECR2_ADROM_MASK		0x03
/** @defgroup hrtim_time_timecr2_adrom ADROM ADC Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIME_TIMECR2_OUTROM_SHIFT		8
#define HRTIM_TIME_TIMECR2_OUTROM_MASK		0x03
/** @defgroup hrtim_time_timecr2_outrom OUTROM Output Roll-Over Mode
@{*/
/**@}*/


#define HRTIM_TIME_TIMECR2_ROM_SHIFT		6
#define HRTIM_TIME_TIMECR2_ROM_MASK		0x03
/** @defgroup hrtim_time_timecr2_rom ROM Roll-Over Mode
@{*/
/**@}*/

/** HRTIM_TIME_TIMECR2_UDM Up-Down Mode **/
#define HRTIM_TIME_TIMECR2_UDM		(1 << 4)
/** HRTIM_TIME_TIMECR2_DCDR Dual Channel DAC Reset trigger **/
#define HRTIM_TIME_TIMECR2_DCDR		(1 << 2)
/** HRTIM_TIME_TIMECR2_DCDS Dual Channel DAC Step trigger **/
#define HRTIM_TIME_TIMECR2_DCDS		(1 << 1)
/** HRTIM_TIME_TIMECR2_DCDE Dual Channel DAC trigger enable **/
#define HRTIM_TIME_TIMECR2_DCDE		(1 << 0)

/**@}*/

/** @defgroup hrtim_time_eeefr3 EEEFR3 HRTIM Timerx External Event Filtering Register 3
@{*/


#define HRTIM_TIME_EEEFR3_EEVACNT_SHIFT		8
#define HRTIM_TIME_EEEFR3_EEVACNT_MASK		0x3f
/** @defgroup hrtim_time_eeefr3_eevacnt EEVACNT External Event A counter
@{*/
/**@}*/


#define HRTIM_TIME_EEEFR3_EEVASEL_SHIFT		4
#define HRTIM_TIME_EEEFR3_EEVASEL_MASK		0x0f
/** @defgroup hrtim_time_eeefr3_eevasel EEVASEL External Event A Selection
@{*/
/**@}*/

/** HRTIM_TIME_EEEFR3_EEVARSTM External Event A Reset Mode **/
#define HRTIM_TIME_EEEFR3_EEVARSTM		(1 << 2)
/** HRTIM_TIME_EEEFR3_EEVACRES External Event A Counter Reset **/
#define HRTIM_TIME_EEEFR3_EEVACRES		(1 << 1)
/** HRTIM_TIME_EEEFR3_EEVACE External Event A Counter Enable **/
#define HRTIM_TIME_EEEFR3_EEVACE		(1 << 0)

/**@}*/
